src/InformationRegisters/УровниИнцидентовПовторноеОповещение/УровниИнцидентовПовторноеОповещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УровниИнцидентовПовторноеОповещение</name>
  <resources>
    <name>ПериодПовторногоОповещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/УровниИнцидентов/УровниИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниИнцидентов</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>КритическаяОшибка</name>
  </enumValues>
</mdclass:Enum>

src/CommonForms/УровниИнцидентовПовторноеОповещение/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УровниПовторногоОповещения = Новый Соответствие;
	УровниПовторногоОповещения.Вставить(Перечисления.УровниИнцидентов.Информация, 7200);
	УровниПовторногоОповещения.Вставить(Перечисления.УровниИнцидентов.Предупреждение, 3600);
	УровниПовторногоОповещения.Вставить(Перечисления.УровниИнцидентов.Ошибка, 1800);
	УровниПовторногоОповещения.Вставить(Перечисления.УровниИнцидентов.КритическаяОшибка, 600);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УровеньИнцидента,
	|	ПериодПовторногоОповещения
	|ИЗ
	|	РегистрСведений.УровниИнцидентовПовторноеОповещение
	|";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		УровниПовторногоОповещения[Выборка.УровеньИнцидента] = Выборка.ПериодПовторногоОповещения;
	КонецЦикла;
			
	НовСтрока = ЭтотОбъект.УровниИнцидентов.Добавить();
	НовСтрока.УровеньИнцидента = Перечисления.УровниИнцидентов.Информация;
	НовСтрока.ПериодПовторногоОповещения = УровниПовторногоОповещения[НовСтрока.УровеньИнцидента];
	
	НовСтрока = ЭтотОбъект.УровниИнцидентов.Добавить();
	НовСтрока.УровеньИнцидента = Перечисления.УровниИнцидентов.Предупреждение;
	НовСтрока.ПериодПовторногоОповещения = УровниПовторногоОповещения[НовСтрока.УровеньИнцидента];
	
	НовСтрока = ЭтотОбъект.УровниИнцидентов.Добавить();
	НовСтрока.УровеньИнцидента = Перечисления.УровниИнцидентов.Ошибка;
	НовСтрока.ПериодПовторногоОповещения = УровниПовторногоОповещения[НовСтрока.УровеньИнцидента];
	
	НовСтрока = ЭтотОбъект.УровниИнцидентов.Добавить();
	НовСтрока.УровеньИнцидента = Перечисления.УровниИнцидентов.КритическаяОшибка;
	НовСтрока.ПериодПовторногоОповещения = УровниПовторногоОповещения[НовСтрока.УровеньИнцидента];
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьПериодыПовторногоОповещения(Команда)
	
	ЗаписатьПериодыПовторногоОповещенияНаСервере();
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьПериодыПовторногоОповещенияНаСервере()
	
	НаборЗаписей = РегистрыСведений.УровниИнцидентовПовторноеОповещение.СоздатьНаборЗаписей();
	Для Каждого ТекСтрока Из ЭтотОбъект.УровниИнцидентов Цикл
		НовСтрока = НаборЗаписей.Добавить();
		НовСтрока.УровеньИнцидента = ТекСтрока.УровеньИнцидента;
		НовСтрока.ПериодПовторногоОповещения = ТекСтрока.ПериодПовторногоОповещения;	
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
